[
    {
        "name": "Socrates",
        "img": "philosophersImages/socrates.jpg",
        "alt": "photo_Socrates",
        "bioShort": "Socrates was a scholar, teacher and philosopher born in ancient Greece. His Socratic method laid the groundwork for Western systems of logic and philosophy. When the political climate of Greece turned against him, Socrates was sentenced to death by hemlock poisoning in 399 B.C. He accepted this judgment rather than fleeing into exile.",
        "bioLong": "Socrates, born in the late fifth centry BC, was a Ancient Greek philosopher whose way of life, character, and thought exerted a profound influence on Western philosophy. Socrates was a widely recognized and controversial figure in his native Athens, so much so that he was frequently mocked in the plays of comic dramatists. (The Clouds of Aristophanes, produced in 423, is the best-known example.) Although Socrates himself wrote nothing, he is depicted in conversation in compositions by a small circle of his admirers—Plato and Xenophon first among them. He is portrayed in these works as a man of great insight, integrity, self-mastery, and argumentative skill. The impact of his life was all the greater because of the way in which it ended: at age 70, he was brought to trial on a charge of impiety and sentenced to death by poisoning (the poison probably being hemlock) by a jury of his fellow citizens. Plato’s Apology of Socrates purports to be the speech Socrates gave at his trial in response to the accusations made against him (Greek apologia means “defense”). Its powerful advocacy of the examined life and its condemnation of Athenian democracy have made it one of the central documents of Western thought and culture."
    },
    {
        "name": "Plato",
        "img": "philosophersImages/plato.jpeg",
        "alt": "photo_Plato",
        "bioShort": "Ancient Greek philosopher Plato was a student of Socrates and a teacher of Aristotle. His writings explored justice, beauty and equality, and also contained discussions in aesthetics, political philosophy, theology, cosmology, epistemology and the philosophy of language. Plato founded the Academy in Athens, one of the first institutions of higher learning in the Western world.",
        "bioLong": "The founder of the Academy in Ancient Athens, Plato was best known as the author of philosophical works of unparalleled influence. Building on the demonstration by Socrates that those regarded as experts in ethical matters did not have the understanding necessary for a good human life, Plato introduced the idea that their mistakes were due to their not engaging properly with a class of entities he called forms, chief examples of which were Justice, Beauty, and Equality. Whereas other thinkers—and Plato himself in certain passages—used the term without any precise technical force, Plato in the course of his career came to devote specialized attention to these entities. As he conceived them, they were accessible not to the senses but to the mind alone, and they were the most important constituents of reality, underlying the existence of the sensible world and giving it what intelligibility it has. In metaphysics Plato envisioned a systematic, rational treatment of the forms and their interrelations, starting with the most fundamental among them (the Good, or the One); in ethics and moral psychology he developed the view that the good life requires not just a certain kind of knowledge (as Socrates had suggested) but also habituation to healthy emotional responses and therefore harmony between the three parts of the soul (according to Plato, reason, spirit, and appetite). His works also contain discussions in aesthetics, political philosophy, theology, cosmology, epistemology, and the philosophy of language. His school fostered research not just in philosophy narrowly conceived but in a wide range of endeavours that today would be called mathematical or scientific."
    },
    {
        "name": "Aristotle",
        "img": "philosophersImages/aristotle.jpeg",
        "alt": "photo_Aristotle",
        "bioShort":"Aristotle (c. 384 B.C. to 322 B.C.) was an Ancient Greek philosopher and scientist who is still considered one of the greatest thinkers in politics, psychology and ethics. When Aristotle turned 17, he enrolled in Plato’s Academy. In 338, he began tutoring Alexander the Great. In 335, Aristotle founded his own school, the Lyceum, in Athens, where he spent most of the rest of his life studying, teaching and writing. Some of his most notable works include Nichomachean Ethics, Politics, Metaphysics, Poetics and Prior Analytics",
        "bioLong": "Considered to be one of the greatest intellectual figures of Western history, Aristotle was the author of a philosophical and scientific system that became the framework and vehicle for both Christian Scholasticism and medieval Islamic philosophy. Even after the intellectual revolutions of the Renaissance, the Reformation, and the Enlightenment, Aristotelian concepts remained embedded in Western thinking. Aristotle’s intellectual range was vast, covering most of the sciences and many of the arts, including biology, botany, chemistry, ethics, history, logic, metaphysics, rhetoric, philosophy of mind, philosophy of science, physics, poetics, political theory, psychology, and zoology. He was the founder of formal logic, devising for it a finished system that for centuries was regarded as the sum of the discipline; and he pioneered the study of zoology, both observational and theoretical, in which some of his work remained unsurpassed until the 19th century. But he is, of course, most outstanding as a philosopher. His writings in ethics and political theory as well as in metaphysics and the philosophy of science continue to be studied, and his work remains a powerful current in contemporary philosophical debate.",
        "fun facts":""
    },
    {
        "name": "Marcus Aurelius",
        "img": "philosophersImages/aurelius.jpeg",
        "alt": "photo_Aurelius",
        "bioShort": "Marcus Aurelius was a Roman Emperor from 161 to 180. He is considered one of the five good Emperors and the last Emperor of the period known as Pax Romana – the age of relative peace in the Roman Empire. He is best remembered for his Meditations – which is an exposition of Stoic philosophy. It includes advice on how to live purposefully and harmoniously within the vaster universe. It also reminds us that death is ever-present, and we are put a small part of the greater universe.",
        "bioLong": "The philosophy of the Roman Emperor Marcus Aurelius can be found in a collection of personal writings known as the Meditations. These reflect the influence of Stoicism and, in particular, the philosophy of Epictetus, the Stoic. The Meditations may be read as a series of practical philosophical exercises, following Epictetus’ three topics of study, designed to digest and put into practice philosophical theory. Central to these exercises is a concern with the analysis of one’s judgements and a desire to cultivate a “cosmic perspective. From a modern perspective Marcus Aurelius is certainly not in the first rank of ancient philosophers. He is no Plato or Aristotle, nor even a Sextus Empiricus or Alexander of Aphrodisias. To a certain extent this judgement is perfectly fair and reasonable. However, in order to assess the philosophical qualities that Marcus does have and that are displayed in the Meditations it is necessary to emphasize that in antiquity philosophy was not conceived merely as a matter of theoretical arguments. Such arguments existed and were important, but they were framed within a broader conception of philosophy as a way of life. The aim was not merely to gain a rational understanding of the world but to allow that rational understanding to inform the way in which one lived. If one keeps this understanding of ‘philosophy’ in mind, then one becomes able to appreciate the function and the philosophical value of Marcus’ Meditations."



    },
    {
        "name": "Seneca",
        "img": "philosophersImages/seneca.jpeg",
        "alt": "photo_Seneca",
        "bioShort": "As a writer, Seneca is known for his philosophical works, and for his plays, which are all tragedies. Seneca regards philosophy as a balm for the wounds of life. The destructive passions, especially anger and grief, must be uprooted, although sometimes he offers advice for moderating them according to reason. He discusses the relative merits of the contemplative life and the active life, and he considers it important to confront one's own mortality and be able to face death. Seneca was also a dramatist. Scholars have tried to spot certain Stoic themes in his tragedies: it is the uncontrolled passions which generate madness, ruination, and self-destruction. This has a cosmic as well as an ethical aspect, and fate is a powerful, albeit rather oppressive, force.",
        "bioLong": "Seneca is a major philosophical figure of the Roman Imperial Period. As a Stoic philosopher writing in Latin, Seneca makes a lasting contribution to Stoicism. He occupies a central place in the literature on Stoicism at the time, and shapes the understanding of Stoic thought that later generations were to have. Seneca’s philosophical works played a large role in the revival of Stoic ideas in the Renaissance. Until today, many readers approach Stoic philosophy through Seneca, rather than through the more fragmentary evidence that we have for earlier Stoics. Seneca’s writings are stunningly diverse in their generic range. More than that, Seneca develops further and shapes several philosophical genres, most important, the letter and so-called “consolations”; his essay On Mercy is considered the first example of what came to be known as the “mirror of the prince” literature."
    }
]